//  Напишите программу, которая позаданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

// Console.WriteLine("Введите номер четверти: ");
// int number = Convert.ToInt32(Console.ReadLine());

// switch (number)
// {
//     case 1: System.Console.WriteLine("X > 0, y > 0"); break;

//     case 2: System.Console.WriteLine("X < 0, y > 0"); break;

//     case 3: System.Console.WriteLine("X < 0, y < 0"); break;

//     case 4: System.Console.WriteLine("X > 0, y < 0"); break;

//     default: System.Console.WriteLine("Такой четверти нет"); break;
// }


// Напишите программу, которая
// принимает на вход координаты двух точек и
// находит расстояние между ними в 2D
// пространстве.
// A (3,6); B (2,1) -> 5,09
// A (7,-5); B (1,-1) -> 7,21


// Console.WriteLine("Введите координату X первой точки: ");
// int Xa = int.Parse(Console.ReadLine());

// Console.WriteLine("Введите координату Y первой точки: ");
// int Ya = int.Parse(Console.ReadLine());

// Console.WriteLine("Введите координату X второй точки: ");
// int Xb = int.Parse(Console.ReadLine());

// Console.WriteLine("Введите координату Y второй точки: ");
// int Yb = int.Parse(Console.ReadLine());

// double result = Math.Sqrt(Math.Pow(Xb - Xa, 2) + Math.Pow(Yb - Ya, 2));

// Console.WriteLine(result);


// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу квадратов чисел от 1 до N.

// Console.WriteLine("Введите число: ");
// int number = int.Parse(Console.ReadLine());

// int i = 1;

// while (i <= number)
// {
//     Console.Write(Math.Pow(i, 2) + " ");
//     ++i;
// }

            // ИЛИ

// Console.WriteLine("Введите число: ");
// int number = int.Parse(Console.ReadLine());

// for (int i = 1; i <= number; ++i)
// {
//     Console.Write(Math.Pow(i, 2) + " ");
// }


